Revit 2026 API

# FillGridOrigin Property

---

Gets and sets the origin of the fill grid.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public UV Origin { get; set; }
```
```vb
Public Property Origin As UV
	Get
	Set
```
```cpp
public:
property UV^ Origin {
	UV^ get ();
	void set (UV^ value);
}
```
```fsharp
member Origin : UV with get, set
```

#### Property Value

UV The origin of the fill grid.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

FillGrid Class

Autodesk.Revit.DB Namespace